app/controllers/products_controller.rb

INSERT INTO "products" ("name", "minimum_stock", "stock", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "MyString"], ["minimum_stock", "9.99"], ["stock", "9.99"], ["created_at", "2019-07-01 00:07:05.854163"], ["updated_at", "2019-07-01 00:07:05.854163"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 980190962]]
---
  def destroy
    @product.destroy

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_product
      @product = Product.find(params[:id])