app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (stock <= minimum_stock)
---
  def to_buy
    @products = Product.where("stock <= minimum_stock")

INSERT INTO "products" ("name", "minimum_stock", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sorvete"], ["minimum_stock", "50.0"], ["created_at", "2019-07-01 00:10:33.783948"], ["updated_at", "2019-07-01 00:10:33.783948"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save