app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)

    respond_to do |format|
      if @transaction.save
---
INSERT INTO "transactions" ("product_id", "amount", "transaction_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 1], ["amount", "100.0"], ["transaction_type", 0], ["created_at", "2019-06-11 21:33:14.708769"], ["updated_at", "2019-06-11 21:33:14.708769"]]

  def destroy
    @transaction.destroy
---
DELETE FROM "transactions" WHERE "transactions"."id" = $1  [["id", 3]]