app/controllers/transactions_controller.rb

    def set_transaction
      @transaction = Transaction.find(params[:id])
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]