app/models/transaction.rb

  	def change_product_stock_create
  		if self.entrada?
  			self.product.stock += self.amount
  		elsif self.saída?
  			self.product.stock -= self.amount
  		end
  		self.product.save
---
UPDATE "products" SET "stock" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["stock", "100.0"], ["updated_at", "2019-06-11 21:36:37.409427"], ["id", 1]]

  	def change_product_stock_destroy
  		if self.entrada?
  			self.product.stock -= self.amount
  		elsif self.saída?
  			self.product.stock += self.amount
  		end
  		self.product.save
---
UPDATE "products" SET "stock" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["stock", "-25.0"], ["updated_at", "2019-06-11 21:37:29.344144"], ["id", 1]]