app/views/products/show.html.erb

  <tbody>
    <% @product.transactions.order(created_at: :desc).each do |transaction| %>
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."product_id" = $1 ORDER BY "transactions"."created_at" DESC  [["product_id", 1]]